README.tex
% Created 2025-11-22 sam. 10:27
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Gabriel TESSIER}
\date{\today}
\title{NixOS Config}
\hypersetup{
 pdfauthor={Gabriel TESSIER},
 pdftitle={NixOS Config},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Modules}
\label{sec:orga0935a7}

I have my modules separated into two subdirectories:
\begin{itemize}
\item System-level - stored in the \href{./modules/system}{system directory}
\item User-level - stored in the \href{./modules/user}{user directory}
\end{itemize}
\section{Hosts}
\label{sec:org38df558}

Configurations for all machines are in \href{./hosts}{hosts}.
\section{Install}
\label{sec:orgb84023d}

Set the \texttt{nix-folder} in \href{./flake.nix}{flake.nix} (the result of \texttt{pwd})

Configure your hosts in \href{./hosts}{hosts}.

Rebuild your system : \texttt{sudo nixos-rebuild switch -{}-{}flake /path/to/this/folder}
\end{document}
